Reports/МатрицаТалантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>МатрицаТалантов</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/НастройкаМатрицыТалантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаМатрицыТалантов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьМатрицуТалантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысокаяОценкаЭффективности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяОценкаЭффективности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысокаяОценкаПотенциала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяОценкаПотенциала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЗанятости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ГруппыВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ГруппыВиджетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоКолонок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Схема</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Виджет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Виджеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/МатрицаТалантов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекстЭффективность", НСтр("ru = 'Эффективность'"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекстПотенциал", НСтр("ru = 'Потенциал'"));
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
	
	ДанныеДляФормированияМатрицы = ДанныеДляФормированияМатрицы(Настройки.ПараметрыДанных.Элементы);
	
	ТаблицаДанныхОтчета = ПолучитьДанныеМатрицыТалантов(ДанныеДляФормированияМатрицы);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ДанныеМатрицыТалантов",ТаблицаДанныхОтчета);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляФормированияМатрицы(ПараметрыДанных)
	
	ДанныеДляФормированияМатрицы = Новый Структура;
	ДобавитьПараметрДляФормированияМатрицы(ДанныеДляФормированияМатрицы, ПараметрыДанных, "Период");
	ДобавитьПараметрДляФормированияМатрицы(ДанныеДляФормированияМатрицы, ПараметрыДанных, "МероприятияОценки");
	ДобавитьПараметрДляФормированияМатрицы(ДанныеДляФормированияМатрицы, ПараметрыДанных, "Подразделение");
	ДобавитьПараметрДляФормированияМатрицы(ДанныеДляФормированияМатрицы, ПараметрыДанных, "ВключаяПодчиненныеПодразделения");
	ДобавитьПараметрДляФормированияМатрицы(ДанныеДляФормированияМатрицы, ПараметрыДанных, "ФизическиеЛица");
	ДобавитьПараметрДляФормированияМатрицы(ДанныеДляФормированияМатрицы, ПараметрыДанных, "Горизонт");
	ДобавитьПараметрДляФормированияМатрицы(ДанныеДляФормированияМатрицы, ПараметрыДанных, "ИспользоватьЭффективность");
	ДобавитьПараметрДляФормированияМатрицы(ДанныеДляФормированияМатрицы, ПараметрыДанных, "ИспользоватьПотенциал");
	
	Возврат ДанныеДляФормированияМатрицы;
	
КонецФункции

Процедура ДобавитьПараметрДляФормированияМатрицы(ДанныеДляФормирование, ПараметрыДанных, ИмяПоля)
	
	Параметр = ПараметрыДанных.Найти(ИмяПоля);
	Если Параметр <> Неопределено И Параметр.Использование Тогда
		ДанныеДляФормирование.Вставить(ИмяПоля, Параметр.Значение);
	Иначе
		ДанныеДляФормирование.Вставить(ИмяПоля, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеМатрицыТалантов(ПараметрыОтчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Обработки.МатрицаТалантов.ДанныеПоказателейПоСотрудникам(Запрос.МенеджерВременныхТаблиц, ПараметрыОтчета);
	ГруппаВиджетов = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ГруппыВиджетов.МатрицаТалантов");
	ДанныеУровней = РегистрыСведений.НастройкаМатрицыТалантов.НастройкиМатрицыТалантов();
	
	Запрос.Текст = ТекстЗапросаДанныхМатрицы();
	
	Запрос.УстановитьПараметр("ТекстВнеМатрицы", НСтр("ru = 'Вне матрицы'"));
	Запрос.УстановитьПараметр("ВысокаяОценкаЭффективности", ДанныеУровней.ВысокаяОценкаЭффективности);
	Запрос.УстановитьПараметр("СредняяОценкаЭффективности", ДанныеУровней.СредняяОценкаЭффективности);
	Запрос.УстановитьПараметр("ВысокаяОценкаПотенциала", ДанныеУровней.ВысокаяОценкаПотенциала);
	Запрос.УстановитьПараметр("СредняяОценкаПотенциала", ДанныеУровней.СредняяОценкаПотенциала);
	Запрос.УстановитьПараметр("ГруппаВиджетов", ГруппаВиджетов);
	Запрос.УстановитьПараметр("ИспользуетсяПотенциал", ПараметрыОтчета.ИспользоватьПотенциал);
	Запрос.УстановитьПараметр("ИспользуетсяЭффективность", ПараметрыОтчета.ИспользоватьЭффективность);
	
	ИтоговаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Возврат ИтоговаяТаблица;
	
КонецФункции

Функция ТекстЗапросаДанныхМатрицы()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВТСотрудникиОрганизации.Сотрудник КАК Сотрудник,
		|	ВТСотрудникиОрганизации.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	ВТСотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА ВТСотрудникиОрганизации.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы)
		|			ТОГДА 1
		|		КОГДА ВТСотрудникиОрганизации.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК УровеньВидаЗанятости
		|ПОМЕСТИТЬ ВТСотрудникиСУровнемВидаЗанятости
		|ИЗ
		|	ВТСотрудникиОрганизации КАК ВТСотрудникиОрганизации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиСУровнемВидаЗанятости.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МИНИМУМ(ВТСотрудникиСУровнемВидаЗанятости.УровеньВидаЗанятости) КАК УровеньВидаЗанятости
		|ПОМЕСТИТЬ ВТФизическоеЛицоПоВидуЗанятости
		|ИЗ
		|	ВТСотрудникиСУровнемВидаЗанятости КАК ВТСотрудникиСУровнемВидаЗанятости
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСотрудникиСУровнемВидаЗанятости.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТСотрудникиСУровнемВидаЗанятости.Сотрудник) КАК Сотрудник,
		|	ВТСотрудникиСУровнемВидаЗанятости.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудникиПоФизическомуЛицу
		|ИЗ
		|	ВТСотрудникиСУровнемВидаЗанятости КАК ВТСотрудникиСУровнемВидаЗанятости
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизическоеЛицоПоВидуЗанятости КАК ВТФизическоеЛицоПоВидуЗанятости
		|		ПО ВТСотрудникиСУровнемВидаЗанятости.ФизическоеЛицо = ВТФизическоеЛицоПоВидуЗанятости.ФизическоеЛицо
		|			И ВТСотрудникиСУровнемВидаЗанятости.УровеньВидаЗанятости = ВТФизическоеЛицоПоВидуЗанятости.УровеньВидаЗанятости
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСотрудникиСУровнемВидаЗанятости.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОценкаПотенциала.Сотрудник КАК Сотрудник,
		|	СУММА(ВТОценкаПотенциала.Потенциал) / КОЛИЧЕСТВО(ВТОценкаПотенциала.Показатель) КАК Потенциал
		|ПОМЕСТИТЬ ВТОбщийПотенциалСотрудника
		|ИЗ
		|	ВТОценкаПотенциала КАК ВТОценкаПотенциала
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОценкаПотенциала.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОценкаЭффективности.Сотрудник КАК Сотрудник,
		|	СУММА(ВТОценкаЭффективности.ОценкаПоказателяПроцент) / КОЛИЧЕСТВО(ВТОценкаЭффективности.Показатель) КАК Эффективность
		|ПОМЕСТИТЬ ВТОбщаяЭффективностьСотрудника
		|ИЗ
		|	ВТОценкаЭффективности КАК ВТОценкаЭффективности
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОценкаЭффективности.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиПоФизическомуЛицу.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА &ИспользуетсяПотенциал
		|				И ВТОбщийПотенциалСотрудника.Потенциал ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА ВТОбщийПотенциалСотрудника.Потенциал > &ВысокаяОценкаПотенциала
		|			ТОГДА 1
		|		КОГДА ВТОбщийПотенциалСотрудника.Потенциал > &СредняяОценкаПотенциала
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА &ИспользуетсяЭффективность
		|				И ВТОбщаяЭффективностьСотрудника.Эффективность ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА ВТОбщаяЭффективностьСотрудника.Эффективность > &ВысокаяОценкаЭффективности
		|			ТОГДА 3
		|		КОГДА ВТОбщаяЭффективностьСотрудника.Эффективность > &СредняяОценкаЭффективности
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК НомерКолонки,
		|	ЕСТЬNULL(ВТОбщаяЭффективностьСотрудника.Эффективность, 0) + ЕСТЬNULL(ВТОбщийПотенциалСотрудника.Потенциал, 0) КАК СуммаХарактеристик
		|ПОМЕСТИТЬ ПоложениеВиджета
		|ИЗ
		|	ВТСотрудникиПоФизическомуЛицу КАК ВТСотрудникиПоФизическомуЛицу
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбщийПотенциалСотрудника КАК ВТОбщийПотенциалСотрудника
		|		ПО ВТСотрудникиПоФизическомуЛицу.Сотрудник = ВТОбщийПотенциалСотрудника.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбщаяЭффективностьСотрудника КАК ВТОбщаяЭффективностьСотрудника
		|		ПО ВТСотрудникиПоФизическомуЛицу.Сотрудник = ВТОбщаяЭффективностьСотрудника.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоложениеВиджета.Сотрудник КАК Сотрудник,
		|	ГруппыВиджетовСхема.Виджет КАК Виджет,
		|	ГруппыВиджетовСхема.ПозицияСтроки КАК ПозицияСтроки,
		|	ГруппыВиджетовСхема.ПозицияКолонки КАК ПозицияКолонки,
		|	ПоложениеВиджета.СуммаХарактеристик КАК СуммаХарактеристик
		|ПОМЕСТИТЬ УровеньСотрудника
		|ИЗ
		|	ПоложениеВиджета КАК ПоложениеВиджета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыВиджетов.Схема КАК ГруппыВиджетовСхема
		|		ПО ПоложениеВиджета.НомерСтроки = ГруппыВиджетовСхема.ПозицияСтроки
		|			И ПоложениеВиджета.НомерКолонки = ГруппыВиджетовСхема.ПозицияКолонки
		|ГДЕ
		|	ГруппыВиджетовСхема.Ссылка = &ГруппаВиджетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОценкаПотенциала.Сотрудник КАК Сотрудник,
		|	ВТОценкаПотенциала.Регистратор КАК Регистратор,
		|	ВТОценкаПотенциала.Показатель КАК Показатель,
		|	ВТОценкаПотенциала.Значение КАК Значение,
		|	ВТОценкаПотенциала.Оценка КАК Оценка,
		|	ВТОценкаПотенциала.Потенциал КАК Потенциал,
		|	0 КАК Эффективность,
		|	ЛОЖЬ КАК ЭтоЭффективность,
		|	ЕСТЬNULL(УровеньСотрудника.Виджет, ЗНАЧЕНИЕ(Справочник.Виджеты.ПустаяСсылка)) КАК Уровень,
		|	УровеньСотрудника.ПозицияСтроки КАК ПозицияСтроки,
		|	УровеньСотрудника.ПозицияКолонки КАК ПозицияКолонки,
		|	УровеньСотрудника.СуммаХарактеристик КАК СуммаХарактеристик,
		|	ВТОценкаПотенциала.МаксимальноеЗначение КАК МаксимальноеЗначение
		|ПОМЕСТИТЬ ВТДанныеДляОтчета
		|ИЗ
		|	ВТОценкаПотенциала КАК ВТОценкаПотенциала
		|		ЛЕВОЕ СОЕДИНЕНИЕ УровеньСотрудника КАК УровеньСотрудника
		|		ПО ВТОценкаПотенциала.Сотрудник = УровеньСотрудника.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТОценкаЭффективности.Сотрудник,
		|	ВТОценкаЭффективности.Регистратор,
		|	ВТОценкаЭффективности.Показатель,
		|	ВТОценкаЭффективности.ФактическоеЗначение,
		|	ВТОценкаЭффективности.ОценкаПоказателя,
		|	0,
		|	ВТОценкаЭффективности.ОценкаПоказателяПроцент,
		|	ИСТИНА,
		|	ЕСТЬNULL(УровеньСотрудника.Виджет, ЗНАЧЕНИЕ(Справочник.Виджеты.ПустаяСсылка)),
		|	УровеньСотрудника.ПозицияСтроки,
		|	УровеньСотрудника.ПозицияКолонки,
		|	УровеньСотрудника.СуммаХарактеристик,
		|	ВТОценкаЭффективности.МаксимальнаяОценка
		|ИЗ
		|	ВТОценкаЭффективности КАК ВТОценкаЭффективности
		|		ЛЕВОЕ СОЕДИНЕНИЕ УровеньСотрудника КАК УровеньСотрудника
		|		ПО ВТОценкаЭффективности.Сотрудник = УровеньСотрудника.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиОрганизации.Сотрудник КАК Сотрудник,
		|	ВТСотрудникиОрганизации.ДолжностьПоШтатномуРасписанию КАК Позиция,
		|	ВТДанныеДляОтчета.Регистратор КАК Регистратор,
		|	ВТДанныеДляОтчета.Показатель КАК Показатель,
		|	ЕСТЬNULL(ВТДанныеДляОтчета.Значение, 0) КАК Значение,
		|	ЕСТЬNULL(ВТДанныеДляОтчета.Оценка, 0) КАК Оценка,
		|	ЕСТЬNULL(ВТДанныеДляОтчета.Потенциал, 0) КАК Потенциал,
		|	ЕСТЬNULL(ВТДанныеДляОтчета.Эффективность, 0) КАК Эффективность,
		|	ЕСТЬNULL(ВТДанныеДляОтчета.ЭтоЭффективность, ЛОЖЬ) КАК ЭтоЭффективность,
		|	ВТДанныеДляОтчета.Уровень КАК Уровень,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТДанныеДляОтчета.ПозицияСтроки, 0) = 0
		|			ТОГДА 99
		|		ИНАЧЕ ВТДанныеДляОтчета.ПозицияСтроки
		|	КОНЕЦ КАК ПозицияСтроки,
		|	ЕСТЬNULL(ВТДанныеДляОтчета.ПозицияКолонки, 0) КАК ПозицияКолонки,
		|	ЕСТЬNULL(ВТДанныеДляОтчета.СуммаХарактеристик, 0) КАК СуммаХарактеристик,
		|	ВЫБОР
		|		КОГДА ВТДанныеДляОтчета.ПозицияСтроки = 1
		|			ТОГДА ""высокий""
		|		КОГДА ВТДанныеДляОтчета.ПозицияСтроки = 2
		|			ТОГДА ""средний""
		|		КОГДА ВТДанныеДляОтчета.ПозицияСтроки = 3
		|			ТОГДА ""низкий""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК УровеньПотеницала,
		|	ВЫБОР
		|		КОГДА ВТДанныеДляОтчета.ПозицияКолонки = 3
		|			ТОГДА ""высокий""
		|		КОГДА ВТДанныеДляОтчета.ПозицияКолонки = 2
		|			ТОГДА ""средний""
		|		КОГДА ВТДанныеДляОтчета.ПозицияКолонки = 1
		|			ТОГДА ""низкий""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК УровеньЭффективности,
		|	ЕСТЬNULL(ВТДанныеДляОтчета.МаксимальноеЗначение, 0) КАК МаксимальноеЗначение
		|ИЗ
		|	ВТСотрудникиОрганизации КАК ВТСотрудникиОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиПоФизическомуЛицу КАК ВТСотрудникиПоФизическомуЛицу
		|		ПО ВТСотрудникиОрганизации.Сотрудник = ВТСотрудникиПоФизическомуЛицу.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДляОтчета КАК ВТДанныеДляОтчета
		|		ПО ВТСотрудникиОрганизации.Сотрудник = ВТДанныеДляОтчета.Сотрудник";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ОпределитьВиджетыМатрицыТалантов()
	
	ГруппаМатрицы = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ГруппыВиджетов.МатрицаТалантов");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыВиджетовСхема.Виджет КАК Виджет
		|ИЗ
		|	Справочник.ГруппыВиджетов.Схема КАК ГруппыВиджетовСхема
		|ГДЕ
		|	ГруппыВиджетовСхема.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ГруппаМатрицы);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Виджет");
	
КонецФункции

Процедура ПередЗагрузкойНастроекВКомпоновщик(Форма, КлючСхемы, КлючТекущегоВарианта, Настройки, ПользовательскиеНастройки) Экспорт
	
	Виджеты = ОпределитьВиджетыМатрицыТалантов();
	
КонецПроцедуры

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	Настройки.РазрешеноВыбиратьИНастраиватьВариантыБезСохранения = Истина;
	Настройки.ФормироватьСразу = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
